src/2022-10-09-org-mode-blog.org
#+TITLE: =org-mode= で簡易ブログ生成
#+DATE: <2022-10-09 Sun>
#+FILETAGS: :blog:emacs:org_mode:

=org-mode= で本ブログを生成しました ([[https://github.com/toyboot4e/toyboot4e.github.io][リポジトリ]]) 。簡単に紹介します。

#+BEGIN_QUOTE
本当はミラーボールを回したかったですが、力不足だったようです。
#+END_QUOTE

* =org-publish= ベースの SSG

** 背景

Org はマークアップ言語です。主に Emacs ユーザに利用されています。

Emacs のエディタ拡張 =org-mode= には、 =.org= ファイルを任意のフォーマットに変換するコマンド (=org-publish=) が付属します。これを SSG として利用すると、フラットなサイトを簡単に生成できます。

** ファイル構成

本ブログのファイル構成は以下です:

#+BEGIN_SRC sh
.
├── build.el   # ビルドスクリプト + ビルド設定 (ELisp)
├── out        # サイト
├── src        # サイトの全ソースファイル
└── x          # ビルドスクリプトを起動するシェルスクリプト
#+END_SRC

=src/= ディレクトリの内容は以下になります。下書きファイルを =*.draft.org= とし、 release ビルド時は無視します:

#+BEGIN_SRC sh
src/
├── img           # 画像ファイル
├── index.org     # 索引 ("sitemap". `org-publish` が自動生成する)
├── *.org         # 投稿記事
├── *.draft.org   # 下書き (`--release` ビルドの際は無視される)
└── style         # CSS, JS
#+END_SRC

** CLI

=x= のサブコマンドを紹介します:

- =./x build=: =src= ディレクトリをビルドします。
- =./x serve=: ローカルサーバを立ち上げます。
- =./x watch=: ソースファイルの変更時に自動的にリビルドします。

* 主なリソース

=org-mode= でブログ生成したいという人がいたら、以下のリンクが役に立つかもしれません。

** 参考記事

=org-publish= の公式マニュアルが説明不足なので、チュートリアルが重宝します:

- [[https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/][Build Your Website with Org Mode - System Crafters]]\\
  =org-publish= と [[https://simplecss.org][Simple.css]] で綺麗なブログを作ります。

- [[https://taingram.org/blog/org-mode-blog.html][Building a Emacs Org - Mode Blog]]\\
  似た内容ですが ELisp の書き方が参考になります。

** The Org Manual

[[https://orgmode.org/org.html][公式マニュアル]] です。意外に短くて説明不足の感はあります:

- [[https://orgmode.org/manual/Exporting.html][13. Exporting]]

  - [[https://orgmode.org/manual/Exporting.html][13.9 HTML Export]]\\
    ヘッダ生成などのオプションを設定できます。ただし自由度が低いので、自分で HTML テンプレートを書くのが良いと思います。

  - [[https://orgmode.org/manual/Advanced-Export-Configuration.html][13.17 Advanced Export Configuration]]\\
    =ox-html= の HTML テンプレートを差し替えることができます。またフィルタを使ってコードブロックの HTML 変換などをオーバーライドできることがわかります。

- [[https://orgmode.org/manual/Publishing.html][14. Publishing]]\\
  =org-publish= のオプションを把握することができます。

** HTML 生成の改良

HTML 生成をハイジャックして完成です:

- [[https://github.com/SystemCrafters/systemcrafters.github.io/blob/master/publish.el][publish.el (System Crafters website)]]\\
 [[https://github.com/tali713/esxml][esxml]] を使ってテンプレート HTML を作成します。

- [[https://www.roygbyte.com/add_syntax_highlighting_to_an_org_publish_project.html][Add syntax highlighting to an org-publish-project]]\\
  コードブロックを [[https://prismjs.com][Prism.js]] 対応の HTML に変換するフィルタが載っています。

* その他

** Org 製のブログ

見かけるたびに追記します。

- [[https://m13o.net/][m13o.net]]: =org-publish= 製
- [[https://taingram.org/blog/][Thomas Ingram]]: =org-publish= 製
- [[https://systemcrafters.cc/][System Crafters]]: =org-publish= 製？
- [[https://distro.tube/][Distro Tube]]: =org-export= 製
- [[https://conao3.com/blog/][Conao3 Note]]: Hugo 製

