2022-10-09-org-mode-blog.html
<!DOCTYPE html>
<html lang="ja"><head><meta charset="utf-8"/><meta name="viewport" content="width=device-width, initial-scale=1"/><title>org-mode で簡易ブログ生成 - toybeam</title><meta name="description" content="devlog of toyboot4e"/><link rel="stylesheet" href="style/simple.min.css"/><link rel="stylesheet" href="style/style.css"/><link rel="stylesheet" href="style/prism.css"/><!-- MathJax --></head><body><header role="banner"><h1><code>org-mode</code> で簡易ブログ生成</h1><p>Oct  9, 2022</p><nav role="navigation"><a href="/">Home</a><a href="https://github.com/toyboot4e">GitHub</a></nav></header><main role="main"><p>
<code>org-mode</code> で本ブログを生成しました (<a href="https://github.com/toyboot4e/toyboot4e.github.io">リポジトリ</a>) 。簡単に紹介します。<br>
</p>

<blockquote>
<p>
本当はミラーボールを回したかったですが、力不足だったようです。<br>
</p>
</blockquote>

<div id="outline-container-orgefae5b4" class="outline-2">
<h2 id="orgefae5b4"><a href="#orgefae5b4"><code>org-publish</code> ベースの SSG</a></h2>
<div class="outline-text-2" id="text-orgefae5b4">
</div>
<div id="outline-container-org6530b32" class="outline-3">
<h3 id="org6530b32"><a href="#org6530b32">背景</a></h3>
<div class="outline-text-3" id="text-org6530b32">
<p>
Org はマークアップ言語です。主に Emacs ユーザに利用されています。<br>
</p>

<p>
Emacs のエディタ拡張 <code>org-mode</code> には、 <code>.org</code> ファイルを任意のフォーマットに変換するコマンド (<code>org-publish</code>) が付属します。これを SSG として利用すると、フラットなサイトを簡単に生成できます。<br>
</p>
</div>
</div>

<div id="outline-container-orgfc1aa05" class="outline-3">
<h3 id="orgfc1aa05"><a href="#orgfc1aa05">ファイル構成</a></h3>
<div class="outline-text-3" id="text-orgfc1aa05">
<p>
本ブログのファイル構成は以下です:<br>
</p>

<div class="org-src-container">
<pre><code class="src language-sh">.
├── build.el   # ビルドスクリプト + ビルド設定 (ELisp)
├── out        # サイト
├── src        # サイトの全ソースファイル
└── x          # ビルドスクリプトを起動するシェルスクリプト
</code></pre>
</div>

<p>
<code>src/</code> ディレクトリの内容は以下になります。下書きファイルを <code>*.draft.org</code> とし、 release ビルド時は無視します:<br>
</p>

<div class="org-src-container">
<pre><code class="src language-sh">src/
├── img           # 画像ファイル
├── index.org     # 索引 ("sitemap". `org-publish` が自動生成する)
├── *.org         # 投稿記事
├── *.draft.org   # 下書き (`--release` ビルドの際は無視される)
└── style         # CSS, JS
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org281c1e1" class="outline-3">
<h3 id="org281c1e1"><a href="#org281c1e1">CLI</a></h3>
<div class="outline-text-3" id="text-org281c1e1">
<p>
<code>x</code> のサブコマンドを紹介します:<br>
</p>

<ul class="org-ul">
<li><code>./x build</code>: <code>src</code> ディレクトリをビルドします。<br></li>
<li><code>./x serve</code>: ローカルサーバを立ち上げます。<br></li>
<li><code>./x watch</code>: ソースファイルの変更時に自動的にリビルドします。<br></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org10812f2" class="outline-2">
<h2 id="org10812f2"><a href="#org10812f2">主なリソース</a></h2>
<div class="outline-text-2" id="text-org10812f2">
<p>
<code>org-mode</code> でブログ生成したいという人がいたら、以下のリンクが役に立つかもしれません。<br>
</p>
</div>

<div id="outline-container-org5d03f89" class="outline-3">
<h3 id="org5d03f89"><a href="#org5d03f89">参考記事</a></h3>
<div class="outline-text-3" id="text-org5d03f89">
<p>
<code>org-publish</code> の公式マニュアルが説明不足なので、チュートリアルが重宝します:<br>
</p>

<ul class="org-ul">
<li><a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">Build Your Website with Org Mode - System Crafters</a><br>
<code>org-publish</code> と <a href="https://simplecss.org">Simple.css</a> で綺麗なブログを作ります。<br></li>

<li><a href="https://taingram.org/blog/org-mode-blog.html">Building a Emacs Org - Mode Blog</a><br>
似た内容ですが ELisp の書き方が参考になります。<br></li>
</ul>
</div>
</div>

<div id="outline-container-orga7e7345" class="outline-3">
<h3 id="orga7e7345"><a href="#orga7e7345">The Org Manual</a></h3>
<div class="outline-text-3" id="text-orga7e7345">
<p>
<a href="https://orgmode.org/org.html">公式マニュアル</a> です。意外に短くて説明不足の感はあります:<br>
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/manual/Exporting.html">13. Exporting</a><br>

<ul class="org-ul">
<li><a href="https://orgmode.org/manual/Exporting.html">13.9 HTML Export</a><br>
ヘッダ生成などのオプションを設定できます。ただし自由度が低いので、自分で HTML テンプレートを書くのが良いと思います。<br></li>

<li><a href="https://orgmode.org/manual/Advanced-Export-Configuration.html">13.17 Advanced Export Configuration</a><br>
<code>ox-html</code> の HTML テンプレートを差し替えることができます。またフィルタを使ってコードブロックの HTML 変換などをオーバーライドできることがわかります。<br></li>
</ul></li>

<li><a href="https://orgmode.org/manual/Publishing.html">14. Publishing</a><br>
<code>org-publish</code> のオプションを把握することができます。<br></li>
</ul>
</div>
</div>

<div id="outline-container-org48b6538" class="outline-3">
<h3 id="org48b6538"><a href="#org48b6538">HTML 生成の改良</a></h3>
<div class="outline-text-3" id="text-org48b6538">
<p>
HTML 生成をハイジャックして完成です:<br>
</p>

<ul class="org-ul">
<li><a href="https://github.com/SystemCrafters/systemcrafters.github.io/blob/master/publish.el">publish.el (System Crafters website)</a><br>
<a href="https://github.com/tali713/esxml">esxml</a> を使ってテンプレート HTML を作成します。<br></li>

<li><a href="https://www.roygbyte.com/add_syntax_highlighting_to_an_org_publish_project.html">Add syntax highlighting to an org-publish-project</a><br>
コードブロックを <a href="https://prismjs.com">Prism.js</a> 対応の HTML に変換するフィルタが載っています。<br></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgec81fbb" class="outline-2">
<h2 id="orgec81fbb"><a href="#orgec81fbb">その他</a></h2>
<div class="outline-text-2" id="text-orgec81fbb">
</div>
<div id="outline-container-org8407773" class="outline-3">
<h3 id="org8407773"><a href="#org8407773">Org 製のブログ</a></h3>
<div class="outline-text-3" id="text-org8407773">
<p>
見かけるたびに追記します。<br>
</p>

<ul class="org-ul">
<li><a href="https://m13o.net/">m13o.net</a>: <code>org-publish</code> 製<br></li>
<li><a href="https://taingram.org/blog/">Thomas Ingram</a>: <code>org-publish</code> 製<br></li>
<li><a href="https://systemcrafters.cc/">System Crafters</a>: <code>org-publish</code> 製？<br></li>
<li><a href="https://distro.tube/">Distro Tube</a>: <code>org-export</code> 製<br></li>
<li><a href="https://conao3.com/blog/">Conao3 Note</a>: Hugo 製<br></li>
</ul>
</div>
</div>
</div>
</main><footer role="contentinfo"><p>Styled with <a href="https://simplecss.org/">Simple.css</a></p><div><a href="/">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div></footer></body></html>
